app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My edit"], ["description", "My article description"], ["created_at", "2019-09-23 17:25:44.737866"], ["updated_at", "2019-09-23 17:25:44.737866"]]
---
  def update
    @article = Article.find(params[:id])
    @article = Article.create(title: params[:article][:title], description: params[:article][:description])